In [1]:
import pandas as pd

In [2]:
#
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
x = [20, 40, 30, 50, 10]
#we will get index number by passing column name
df1 = pd.DataFrame(x, columns = ['a'])
df1

    a
0  20
1  40
2  30
3  50
4  10

In [4]:
y = [[10, 11, 12, 13],['C#', 'java', 'Python', '.net'],[True,False, True, True]]
y

[[10, 11, 12, 13], ['C#', 'java', 'Python', '.net'], [True, False, True, True]]

In [5]:
df2 = pd.DataFrame(y, columns = ['Ram', 'Madhu', 'Gunjan', 'Diya'])
df2

    Ram  Madhu  Gunjan  Diya
0    10     11      12    13
1    C#   java  Python  .net
2  True  False    True  True

In [8]:
dict = {
    'Name' : ['Raju', 'Kavita', 'Kavya'],
    'Age' : [30, 25, 28],
    'Course' : ['Python', 'Java', 'Android']
    
}
dict

{'Name': ['Raju', 'Kavita', 'Kavya'],
 'Age': [30, 25, 28],
 'Course': ['Python', 'Java', 'Android']}

In [10]:
df3 = pd.DataFrame(dict) #In dict we need not give column name like list.
df3

     Name  Age   Course
0    Raju   30   Python
1  Kavita   25     Java
2   Kavya   28  Android

In [13]:
dict1 = {
    'Trainers Name' : ['Raghunath', 'Faisal', 'Satish'],
    'Mobile Nos.' : ['9823446783', '7627262627', '7463582820'],
    'Age' : [28, 29, 32],
    'Course' : ['Django', 'Python', 'Java']
}

In [23]:
df4 = pd.DataFrame(dict1, index = ['E1', 'E2', 'E3'])
df4

   Trainers Name Mobile Nos.  Age  Course
E1     Raghunath  9823446783   28  Django
E2        Faisal  7627262627   29  Python
E3        Satish  7463582820   32    Java

In [24]:
df4['Trainers Name']

E1    Raghunath
E2       Faisal
E3       Satish
Name: Trainers Name, dtype: object

In [25]:
df4['Course'] #To get single column data

E1    Django
E2    Python
E3      Java
Name: Course, dtype: object

In [27]:
df4[['Trainers Name', 'Age']] #To get multiple column data

   Trainers Name  Age
E1     Raghunath   28
E2        Faisal   29
E3        Satish   32